<template>
  <div class="help_content_box">
    <div class="he_title">{{t('help_page_rule')}}</div>
    <div class="he_txt">
      <div class="he_txt_list">
        为了让您每一天都能尽情享受PKBET娱乐提供的最佳服务与体验。
        PKBET提醒您：在使用PKBET提供的服务前，请您务必仔细阅读并透彻理解本服务条款。如果您不接受以下服务条款，请您切勿在PKBET进行注册或游戏。
        如果您使用PKBET提供的服务，您的使用行为将被视为对本服务条款全部内容的认可。
      </div>
    </div>

    <div class="he_title">{{t('定义')}}</div>
    <div class="he_txt">
      <div class="he_txt_list">（一）：以下条款适用于用户使用和参与由PKBET经营的其他网站 ("游戏网站") 提供的网上 "玩真钱" 模式的游戏服务 ("游戏服务")。本条规须与特定游戏的游戏规则 (统称 "游戏规则") 及适用于游戏服务和游戏软件的使用及与连接进入游戏网站和其中所含游戏信息的其他条规 (统称 "本条规") 一并阅读。</div>
      <div class="he_txt_list">（二）："游戏" 就本条规而言, 包括但不限于通过游戏网站提供的任何游戏服务进行的投注、游戏及各类游戏活动; "连接设备" 指任何应用连接设备, 包括但不限于为使用和连接游戏网站、参与游戏服务而采用的个人电脑、笔记本电脑、移动电话、个人数码助理、PDA电话、手提设备。"游戏软件" 指经监管机关批准的、安装在用户连接设备上的电脑程序、数据文件或任何其他资讯及信息内容 (包括与之有关的任何用户信息), 以便用户通过用户连接设备使用、连接和参与在游戏网站上提供的游戏服务; "体育游戏" 指游戏网站下 "体育游戏" 链接或标题项下接入或提供的互联网游戏系统, 及所有与其相关的服务和网上游戏活动。</div>
      <div class="he_txt_list">（三）：我们保留不时修订、更新和修改本条规和游戏规则 (或其任何部分) 的绝对权利。上述任何修订、更新或修改将在游戏网站上公布。经修订、更新或修改的本条规和游戏规则于其在游戏网站上公布时生效。用户在上述修订、更新或修改公布之后继续通过游戏网站和游戏设备使用、连接和参与游戏服务, 视为用户同意并接受所公布的经修改或更新的本条规和游戏规则。</div>
      <div class="he_txt_list">（四）：用户确认并同意, 用户自行负责查阅上述修订、更新或修改的内容。PKBET可自主决定将上述修订、更新或修改的内容通知用户。上述修订、更新或修改的内容可由PKBET自主决定不时通知用户, 但PKBET并无任何义务向用户通知上述更新或修改的内容。</div>
      <div class="he_txt_list">游戏资讯和知识产权</div>
      <div class="he_txt_list">（五）：通过游戏网站、游戏服务、游戏设备或任何其他方式提供、向用户公开、可被用户获取、产生或收集的信息、资料和数据, 包括但不限于营销计划和资料、成绩、统计数据、赛事数据和赛程表、概率和投注数据、文字、图标、音像资讯 ("游戏资讯"), 属于PKBET和PKBET的许可人所有, 仅供用户用于个人非商业性目的。</div>
      <div class="he_txt_list">（六）：除在本条规中明文规定的外, 未经我们或第三方资料专有人的事先书面同意, 用户不得以任何方式或手段改编、拷贝、修改、复制、储存、散发、展示、公开播放、制入有线节目、出版、传送、出售、出借、出租、许可使用游戏资讯或以其他方式使得任何他人或其他网站、网上服务或公告板或任何其他媒体或连接设备可以获得、使用、连接上述游戏资讯。</div>
      <div class="he_txt_list">（七）：在游戏网站或通过连接设备提供的游戏软件、游戏服务和游戏资讯享受著作权、商标和其他形式的知识产权和专利保护。游戏网站上的游戏软件、游戏服务和游戏资讯的所有权利、产权和利益均属PKBET或PKBET许可人所有、许可其使用或受其控制。用户确认, 用户并未通过使用或连接在游戏网站或通过连接设备提供的游戏软件、游戏服务和游戏资讯取得上述游戏软件、游戏服务和游戏资讯的任何权利、利益或许可。</div>
    </div>

    <div class="he_title">{{t('使用条件')}}</div>
    <div class="he_txt">
      <div class="he_txt_list"> 作为使用游戏服务的条件, 用户保证并承诺, 用户不得以任何违反适用于用户的任何法律、违反本条规或被本条规所禁止的目的使用或连接游戏网站、游戏服务、游戏软件或游戏资讯。</div>
      <div class="he_txt_list">游戏软件使用权</div>
      <div class="he_txt_list"> 1. 用户特此确认并同意, 用户通过连接设备以下载或其他方式获得的以便其远程使用的游戏网站的游戏软件属于游戏服务的一部分, 为PKBET或PKBET的许可人的财产; 用户对该等游戏软件不享有任何权利。用户不得以任何方式或以任何手段改编、拷贝、修改、复制、储存、散发、展示、公开播放、传播、广播、制入有线节目、出版、传送、出售、出借、出租、许可使用游戏软件或以其他方式交流或使游戏软件对任何他人或其他网站、网上服务或公告板或任何其他媒体或连接设备开放。</div>
      <div class="he_txt_list"> 2.PKBET授权和散发游戏软件的目的仅为游戏软件的终端用户能完全连接和使用游戏服务。</div>
      <div class="he_txt_list"> 3. 用户不得: （1）安装或传载游戏软件至其他连网设备的服务器或采取其他步骤使游戏软件可以通过任何形式或公告板、网上服务或远程拨号或网络使他人得到; （2）散发、出借、出租、转授权、拷贝、转让、转移或以其他方式使任何其他人得到游戏软件或使用游戏软件的使用权; （3）允许其他人使用游戏软件; （4）设立或提供任何方式 (包括但不限于仿真程序) 使他人使用游戏软件; （5）翻译、反向工程、反向编译, 反汇编、修改、破解、全部或部分地以游戏软件或其源代码为基础开发衍生产品; (6)拷贝、修改、翻译或全部或部分地以游戏软件的相关用户文件为基础开发衍生产品。</div>
      <div class="he_txt_list"> 4. 用户承认并同意, 游戏网站上提供的及或通过联连设备或其他方式提供的游戏软件或游戏软件均归PKBET和PKBET许可方所有, 并受著作权、商标权和其他知识产权和专利权的保护。用户特此承认, 游戏软件的结构、组织和源代码为PKBET和PKBET许可人的极具价值的商业秘密。用户承认除根据使用权向用户授予的权利外, 用户对游戏软件或游戏软件用户文件不享有任何权利和权益。</div>
      <div class="he_txt_list"> 5. 本协议因任何原因终止, 本协议顶下所授予的使用权自动作废, 用户应停止使用游戏软件并将游戏软件从联连设备中卸载。</div>
    </div>

    <div class="he_title">{{t('交易结算')}}</div>
    <div class="he_txt">
      <div class="he_txt_list"> 1. 用户使用信用卡或借记卡的, 持卡人姓名须与会员登记和申请过程中所使用的姓名一致。若发生持卡人姓名和账户登记和会员申请所使用的姓名不一致的情况,PKBET有权拒绝就相关交易进行结算。</div>
      <div class="he_txt_list"> 2. 用户承担向PKBET或其他用户 (视具体情况而定) 支付所有应付款项的一切责任。用户同意对任何付款不实施或促使他人实施退款, 不拒绝或撤销付款, 并向PKBET偿付所有被退还、拒绝或撤销的付款以及由此引起的所有损失和费用。PKBET根据自主判断, 有权终止向个别用户或使用某类信用卡或借记卡付款的用户提供服务或支付款项。</div>
      <div class="he_txt_list"> 3. 彩金不包括下注额, 用户在下注时应考虑这一因素。</div>
      <div class="he_txt_list">  4. 彩金将存入用户账户。任何款项或彩金在存入帐户的过程中发生错误,PKBET 不负任何形式的任何责任, 且PKBET有权在任何时候或在事后宣布涉及该等款项的交易无效。用户一旦发现账户内款项汇存有误, 有责任立即通知 PKBET。</div>
      <div class="he_txt_list">  5. 在任何适用法律下就彩金所应缴付的税款和费用均由用户自行负责缴付。</div>
    </div>

    <div class="he_title">{{t('领取彩金')}}</div>
    <div class="he_txt">
      <div class="he_txt_list"> 1. 用户的彩金经结算后, 将存入用户账户, 具体提取办法参照我们彩金提取规定并须出示我们认可的有效带照身份证或信用、借记卡。</div>
      <div class="he_txt_list">  2. 在用户所持的信用卡或借记卡发行银行允许的情况下, 彩金可以直接存入用户交纳押金所用的信用卡或借记卡账户。支票或电汇的收款人以登记或申请会员时所用的姓名为准。以信用卡或借记卡支付押金的, 收款人还必须是信用卡或借记卡的登记持卡人。</div>
    </div>

    <div class="he_title">{{t('促销和奖励')}}</div>
    <div class="he_txt">
      <div class="he_txt_list">
        1. 所有促销、奖励和特价均须遵守本条规及PKBET针对具体促销活动所不时制定的规定。PKBET保留在任何时候中止、取消或修改该等奖励或促销或其相关规定及条款的权力。
      </div>
      <div class="he_txt_list">
        2. 若PKBET认定有人滥用或企图滥用某项奖励或促销活动, 或可能因该等滥用行为而获利,PKBET有权自主决定以其认为合适的方式阻止、拒绝, 中止、或撤消任何用户参加有关奖励或促销活动。
      </div>
    </div>

    <div class="he_title">{{t('赔偿')}}</div>
    <div class="he_txt">
      <div class="he_txt_list">
        用户同意, 由于用户连接游戏网站、下载或安装游戏软件、下注或以其他方式使用游戏服务、游戏软件或游戏资讯、或违背本条规或游戏规则, 而对PKBET、PKBET的股东、雇员、管理人员、董事、受许可方、经销商、关联方、子公司或代理商造成的任何损失、损害或及索赔 (包括合理的律师费), 用户须予以全额赔偿。
      </div>
    </div>

    <div class="he_title">{{t('免责声明及特别注意事项')}}</div>
    <div class="he_txt">
      <div class="he_txt_list"> 1. 游戏完全是一项个人选择, 以个人判断与分析为依据, 且风险自负的行为。用户下注的同时, 即表明用户承认游戏服务、游戏网站和游戏资讯并无冒犯性, 且并不令人反感、不公平或有悖公共道德。一些司法管辖区对网上或岸外网上游戏的合法性尚无定论; 而另一些司法管辖区则明确规定网上游戏 (在司法管辖区域内或岸外) 均属非法行为。我们不鼓励任何人在非法的情况下使用和连接游戏网站、游戏资讯或游戏服务。游戏服务、游戏资讯和游戏网站的设立和提供并不构成我们发出要约、招揽或邀请任何人在那些规定使用或连接上述内容为非法行为的国家内使用或连接上述内容。用户独立承担遵守其所适用之相关法律规定的责任, 而PKBET不就游戏服务、游戏软件、游戏网站或其中的游戏资讯与用户所适用的法律规定相符作出任何声明。 </div>
      <div class="he_txt_list"> 2. 游戏服务、游戏软件、游戏网站和游戏资讯均按 "原状原则" 提供。除本条规明示的外,PKBET不就游戏服务、游戏网站、游戏软件和游戏资讯作出任何声明或保证。故所有有关游戏服务、游戏软件、游戏网站和游戏资讯的声明或保证, 不论明示或暗示、法定与否, 特此在法律允许的最大范围内予以排除。PKBET不就游戏服务、游戏软件、游戏网站或游戏资讯的准确性、及时性、安全性、连续性、正确性或抗外界干扰性 (任何性质), 以及更正所发现的任何缺陷作出保证。PKBET亦不保证游戏服务、游戏软件、游戏网站和游戏资讯或提供上述内容的服务器不含有任何病毒、间谍软件、广告软件或其他具恶意性、破坏性或可导致电脑瘫痪的代码、程序、数据、宏指令或可影响任何连接设备或其中所存数据的其他软件或特性。用户承诺将自行自费采取预防措施, 确保其使用或连接游戏服务所用的过程、方法或连接设备、以及游戏软件的安装和游戏网站的使用, 均不会带来电脑病毒、间谍软件、广告软件或具恶意性、破坏性或可导致电脑瘫痪的其他代码, 或导致其连接设备或其中所存数据受到干扰和破坏的其他风险。 </div>
      <div class="he_txt_list"> 3. 若发生与账户结算或游戏服务的其他方面有关的系统错误或通讯错误,PKBET不承担由此引起的任何责任。在此情况下,PKBET有权取消所有受上述错误影响的下注并采取任何更正行动。 </div>
      <div class="he_txt_list"> 4. 在任何情况下, 因用户连接、使用或参与游戏服务、游戏网站、游戏软件和游戏资讯而发生任何损害、损失或支出, 包括用户之连接设备或所存数据受到任何干扰或破坏,PKBET不承担任何责任。此外, 对游戏服务、游戏网站、游戏软件和游戏资讯中由第三方 (包括但不限于宽带和电信服务供应商) 所提供的内容,PKBET亦不作任何保证和声明且不予负责; 在任何情况下,PKBET均不对上述第三方合作者的任何违约、过错或不作为承担责任。 </div>
      <div class="he_txt_list"> 5. 在任何情况下,PKBET、其关联公司、关联方、合伙人、管理人员、雇员和代理均不对任何损害、损失或支出承担责任, 包括但不限于因用户连接或使用游戏服务、游戏网站、游戏软件和游戏资讯、或与用户连接或使用游戏服务、游戏网站、游戏软件和游戏资讯有关的、或因用户下载、安装或使用游戏软件所引起的任何直接、间接、因果性或特别的损害或经济损失, 不论PKBET是否被告知可能发生上述损害、损失或支出。在任何情况下, 就与用户下注直接相关的任何事宜、事件或情形所引起或与之相关的任何损失或损害 (不论是否基于合约、侵权、严格责任或其他原因), 在法律允许的最大范围内, PKBET对用户的全部责任 (如有) 应不超过用户的相应下注额。 </div>
      <div class="he_txt_list"> 6. 用户承认, 游戏资讯在性质上可能全部或部分地具有临时性, 并且可按本条规予以修订、修改或更改。因此, 用户承认游戏资讯仅为参考之用, 不构成任何建议、意见或招揽, 不构成任何具约束力的声明、保证、合约义务或用户依据的内容和基础。 </div>
      <div class="he_txt_list"> 7. 用户特此承认并同意, 在考虑所有相关因素, 包括但不限于用户向PKBET提供对价的价值后, 本条规所述之所有责任豁免和义务排除代表用户和PKBET协议中公平、合理的风险分担和利益分配。用户进一步同意上述免责和限制在适用法律允许的最大范围内具有强制执行力。 </div>
      <div class="he_txt_list"> 8. 如果用户对任何游戏或比赛的结果存有异议, 应在该等结果宣布之日后十四 (14) 天内向我们书面投诉。若出现用户连接设备所显示与PKBET系统的交易记录中所存的交易结果不符的情况 (尽管发生这种情况的可能性很小), 用户同意PKBET系统中交易记录所记载的由我们的技术总监认证的交易结果应为该等结果具终局性的不容置疑的证据。 </div>
      <div class="he_txt_list"> 9. PKBET承诺提供公正和及时的争议解决方案, 纠正不需费用。所有顾客的交易详情都会完整的储存于我们的资料库。这些记录存档为 5 年 (从交易日期算起), 并在纠纷解决机构的需求中提供。 </div>
    </div>

    <div class="he_title">{{t('终止、关户及暂停游戏服务')}}</div>
    <div class="he_txt">
      <div class="he_txt_list"> 1. PKBET如有充分理由相信或证明以下情形, 除本条款项下PKBET所享有的其他权利外, PKBET有权, 根据自主判断, 宣布任何彩金无效并没收用户下注账户中所存余额、终止本协议或暂停提供游戏服务/冻结用户账户:  </div>
      <div class="he_txt_list_1"> （1）用户在PKBET拥有不止一个活动账户;  </div>
      <div class="he_txt_list_1">  （2）用户姓名与向PKBET进行购卖或支付押金所用的信用卡或借记卡或其他付款账户的持有人姓名不符;  </div>
      <div class="he_txt_list_1"> （3）用户参与PKBET促销并在未满足促销要求之前退出该促销;  </div>
      <div class="he_txt_list_1">（4）用户提供不正确或误导性的注册信息;  </div>
      <div class="he_txt_list_1">（5）用户未提供或遗漏提供必要的身份资料;  </div>
      <div class="he_txt_list_1">（6）用户不满法定年龄;  </div>
      <div class="he_txt_list_1">（7）用户连接和使用游戏服务所在的地区在法律上禁止使用游戏服务;  </div>
      <div class="he_txt_list_1">（8）用户对我们实施或促使他人对我们实施 "退款", 或否认以其账户名义进行的任何交易或押金;  </div>
      <div class="he_txt_list_1">（9）用户押金来源于刑事犯罪或其他非法或未经授权的活动;  </div>
      <div class="he_txt_list_1">（10）用户被发现欺诈或企图欺诈任何人或已经对任何人实施欺诈, 或经PKBET认定用户使用专门设计用以干扰/捣毁系统之人工智能或其他系统 (包括机械、电脑、软件或其他自动化系统), 或被发现与其他游戏玩客勾结或企图与其他赌客勾结欺骗PKBET或其他游戏玩客;  </div>
      <div class="he_txt_list_1">（11）用户允许 (不论是否故意) 他人使用其账户;  </div>
      <div class="he_txt_list_1">（12）用户未遵守本协议项下的任何使用规定;  </div>
      <div class="he_txt_list_1">（13）或用户未告知其身在菲律宾、台湾、美国、新加坡、香港、法国、瓜德罗普、盖亚那、马提尼克和留尼旺境内的事实。  </div>
      <div class="he_txt_list">  2. 若我们规定暂停提供游戏服务或冻结账户, 在用户实施必要的纠正措施 (如可以纠正), 且我们确认完全满意用户的纠正措施之后, 游戏服务和用户账户将被恢复和解冻。</div>
      <div class="he_txt_list">  与外部网站的链接</div>
      <div class="he_txt_list_1"> 1. 游戏网站可能含有与并非PKBET维护的外部网站的链接。与外部网站的链接仅为用户方便而提供,PKBET不承诺确保上述链接所含内容的准确性、时效性或被维护, 且不就此承担任何责任。</div>
      <div class="he_txt_list_1"> 2.PKBET不就外部网站的内容资讯或隐私保护政策或在外部网站宣传、出售或以其他方式开放的任何产品或服务承担任何责任、负责提供或审查、予以批准或核准、或作出任何声明或保证。</div>
      <div class="he_txt_list_1"> 3.PKBET不因用户使用游戏网站所提供的任何外部网站链接而发生的或与之相关的任何损失或损害而承担合约，侵权，疏忽或其它责任。</div>
      <div class="he_txt_list_1"> 4. 除非明文规定, 否则PKBET在任何情况下均不得被视为与外部网站上的任何声明、意见、产品或服务商标、标记、标志或其他图案、在外部网站宣传、出售或以其他方式开放的任何产品或服务、外部网站的经营者或所有者、或以任何方式与外部网站相关的任何人具有任何关系或联系。</div>
      <div class="he_txt_list"> 与游戏网站的链接/框入</div>
      <div class="he_txt_list">  用户不得就游戏网站或游戏服务的任何部分设置链接、深链接或文中链接 (deep or in-line links)、或框入 (frame) 游戏资讯。</div>
      <div class="he_txt_list"> 增加或中断游戏种类</div>
      <div class="he_txt_list"> 我们保留自行决定, 不经通知用户, 于任何时候在游戏网站增加新的游戏种类或功能, 或开始、停止、中断、限制连接或修改任何游戏种类或功能的权利, 且不就此对任何人承担任何责任。</div>
      <div class="he_title_sec">  违反本条规</div>
      <div class="he_txt_list">  PKBET保留就违反本条规的行为依法寻求救济 (法律及衡平法) 的权利, 包括自行决定在任何时候基于任何理由拒绝或限制任何特定的人连接游戏服务、游戏网站和游戏资讯、阻止通过特定互联网地址或连接设备连接游戏服务、游戏网站和游戏资讯的权利。</div>
      <div class="he_txt_list"> 优先顺序</div>
      <div class="he_txt_list"> 游戏规则 (若适用) 和适用于使用和连接游戏服务、游戏软件、游戏资讯和游戏网站的任何其他条规均构成本条规的组成部分。</div>
      <div class="he_txt_list"> 若游戏规则和适用于使用和连接游戏服务、游戏软件、游戏资讯和游戏网站的任何其他条规与本条规存有抵触, 则除非另行明文规定, 否则以本条规为准。</div>
      <div class="he_title_sec"> 不可抗力</div>
      <div class="he_txt_list"> 若PKBET由于发生下列其无法控制的任何性质的事件 (包括但不限于天灾、适用法律法规的变更、政府、民政或军事机关的作为或不作为、法院命令、恐怖活动、闪电或火灾、罢工、停工或其他劳资纠纷、洪水、干旱、战争、暴乱、盗窃、传输或系统故障、通讯或宽带服务故障或中断、电力供应或设备故障或不足、恶劣气候、地震和自然灾害) 未能或迟延履行本条规所规定的任何义务, 不构成违反本条规。用户同意采取一切必要行动尽量减轻上述事件的后果。</div>
      <div class="he_title_sec"> 弃权</div>
      <div class="he_txt_list"> PKBET 在任何时候未能执行本条规任何条款不可视为PKBET放弃本条规所规定的权利或以任何方式影响本条规全部或部分的有效性, 且不影响PKBET采取进一步行动的权利。</div>
      <div class="he_title_sec"> 可分割性</div>
      <div class="he_txt_list"> 若任何条款或其任何部分被有关机关认定为在任何程度上无效、不合法或不可执行, 则该条款或该部分在上述程度上与其他条款分割, 其他条款在法律允许的范围内继续完全有效</div>
    </div>

    
  </div>
</template>

<script setup lang='ts'>
import { useI18n } from 'vue-i18n';
const { t } = useI18n();
</script>

<style lang='less' scoped>
@import './index.less';
</style>
